package lab6.task5;

import lab6.task5.buildings.builder.ListBuildingsBuilder;
import lab6.task5.buildings.subclass.Hospital;
import lab6.task5.buildings.subclass.House;
import lab6.task5.buildings.subclass.School;
import lab6.task5.buildings.subclass.Store;

public class Main {
    /*
        На вулиці мають бути присутніми будинки різного типу. Наприклад, житлові будинки,
    магазини, лікарні, школи. Передбачити тестову ініціалізацію кожного об'єкта та вулиці загалом.
    Кожен будинок повинен мати певну адресу в межах вулиці. Крім того, кожен тип будинку
    повинен мати свою сукупність полів. Наприклад, має бути тип магазину та перелік відділів
    у ньому (наприклад приватний маленький магазин повинен мати 1 відділ, супермаккет 5 відділів),
    кількість мешканців у житловому будинку, кількість учнів та рівень акредитації у школі
    (загальноосвітня, гімназія, ліцей тощо). Кількість учнів у школі прив'язати до рівня акредитації
    та випадково обирати у певному діапазоні.
         Передбачити можливість встановлення адреси кожного об'єкта як через конструктор, і
    через сеттер. Передбачити можливість додавання нового будинку на вулицю та видалення
    будинку. Також передбачити віртуальний метод, який прийматиме рядок та на його основі
    встановлюватиме поля об'єкта. Зробити висновок інформації про кожну оселю в консоль.
    Зробити виведення інформації вулицею в консоль. Зробити спосіб. який для випадково
    обраного житлового будинку знаходить у заданій околиці (певну кількість будинків від
    адреси будинку) усі магазини, що мають відділ заданого типу.
        Генерацію тестового покриття зробити за допомогою статичної фабрики.
    Взаємодія з користувачем зробити через меню, при цьому передбачити окремий клас.
    У роботі використовувати інтерфейси, абстрактні класи (за потреби) та перерахування.
    За потреби використовувати механізм обробки винятків.

     */
    public static void main(String[] args) {
        var builder = new ListBuildingsBuilder();
        var buildings = builder
                .addBuildings(School.class, 3)
                .addBuildings(House.class, 15)
                .addBuildings(Store.class, 2)
                .addBuildings(Hospital.class, 1)
                .build();
        System.out.println(buildings);
    }
}
