package task2;

import java.util.ArrayList;

public class Main {
    /*
    Завдання 2. Використовуючи фреймворки Lombok та JUnit5 виконайте наступне завдання:
    Розробити систему "Автобаза".
    Щодня з'являються випадково заявки на перевезення, які
    Диспетчер розподіляє на Рейси між Водіями та призначає для цього Автомобіль.
    Заявка на рейс повинна містити пункт призначення, кількість та тип вантажу.
    Водій на рейс визначається виходячи із стажу, необхідного для перевезення зазначеного
    у заявці товару, складності керування Автомобілем та Довжини шляху.
    Автомобіль на рейс визначається з принципу оптимізації ваги, що перевозиться, і вантажопідйомності автомобіля.
    Під час подорожі автомобіль може зламатися. Водій може зробити заявку на ремонт.
    Після досягнення кінцевого пункту водій отримує певну суму виплат. При цьому
    звільняється автомобіль та водій, і вони доступні для виконання наступних заявок.
    Водій робить відмітку про виконання Рейсу та стан Автомобіля.
    Під час розробки програми використовувати контейнерні класи стандартної бібліотеки.
    Зробити логування усіх подорожей у файл через файлові потоки. Зробити збір статистики
    скільки вантажів було перевезено кожним водієм, скільки вантажів перевезено до конкретного
     пункту призначення, водії з найбільшим заробітком тощо.
    Протестуйте класи та методи, що реалізують  логіку роботи зі створеними класами моделі
     даних за допомогою тестів фреймворку JUnit5.
     */
    public static void main(String[] args) {

    }
}
