package lab3.task1;

public class Main {
    /*
        Завдання 1. Описати клас для зберігання даних про тип об’єктів у
    заданій предметній області. При створенні класу дотримуватися принципу
    інкапсуляції – усі поля з даними повинні бути закритими, а для роботи з
    даними, що містяться у цих полях, реалізувати відповідні методи. Для
    створення екземплярів класу реалізувати відкриті конструктори, що
    заповнюють поля об’єктів даними. Реалізувати перевантаження одного – двох
    методів класу та конструктора класу. Для демонстрації функціонування класу
    створити масив з 5-7 екземплярів класу. Для генерування характеристик класу
    створити масиви можливих константних наборів даних та утілітний клас для
    випадкового вибору значення характеристик екземпляру та масиву екземплярів.

    Для створеного масиву реалізувати:
    а) вивід на консоль даних з усіх елементів масиву;
    б) вивід даних лише тих елементів, які відповідають заданому у варіанті
    завдання критерію;
    в) пошук в масиві та вивід на консоль об’єктів з вказаною властивістю.

    4. Предметна область: інтернет-магазин, клас: товар, орієнтовний перелік
    полів: назва товару, категорія, опис товару, ціна за одиницю, наявність на
    складі, кількість, дата поставки. Вивести окремо список відсутніх товарів.
    Реалізувати пошук товарів за вказаною категорією.
     */
    public static void main(String[] args) {

    }
}
